Перем ПараметрыВыполнения;
Перем СценарийПараметрыВыполнения;
Перем КаталогСценариев;

Функция ПостОбработкаПомещенияВХранилище(ПараметрыЗапроса) Экспорт

	РезультатБулево = Истина;
	// --
	УстановитьПараметрыВыполнения();
	Сведение = СценарийПараметрыВыполнения.ПолучитьСведение(ПараметрыЗапроса.ИмяСистемы);

	Если Сведение <> Неопределено Тогда
		ЗапускПайплайн = ЗагрузитьСценарий(ОбъединитьПути(КаталогСценариев, "run-gitlab-pipeline.os"));

		ПараметрыПайплайна = Новый Структура;
		ПараметрыПайплайна.Вставить("АдресСервера", ПараметрыВыполнения.АдресСервера);
		ПараметрыПайплайна.Вставить("Таймаут", ПараметрыВыполнения.Таймаут);
		ПараметрыПайплайна.Вставить("IDПроекта", Сведение.IDПроекта);
		ПараметрыПайплайна.Вставить("ТокенТриггер", ПараметрыВыполнения.ТокенТриггер);
		ПараметрыПайплайна.Вставить("ИмяВетки", Сведение.ИмяВетки);
		ПараметрыПайплайна.Вставить("КаталогСценариев", КаталогСценариев);
		ПараметрыПайплайна.Вставить("ИмяСистемы", ПараметрыЗапроса.ИмяСистемы);

		ЗапускПайплайн.ЗапуститьПайплайн(ПараметрыПайплайна);

	КонецЕсли;
	// --
	Возврат РезультатБулево;

КонецФункции

Функция ОбработкаПомещенияВХранилище(ПараметрыЗапроса) Экспорт
	
	СообщениеОбОшибке = "";
	
	УстановитьПараметрыВыполнения();
	Сведение = СценарийПараметрыВыполнения.ПолучитьСведение(ПараметрыЗапроса.ИмяСистемы);

	Если Сведение <>  Неопределено Тогда
		Проверка = ЗагрузитьСценарий(ОбъединитьПути(КаталогСценариев, "check-issue-number.os"));
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("Комментарий", ПараметрыЗапроса.Комментарий);
		ПараметрыПроверки.Вставить("АдресСервера", ПараметрыВыполнения.АдресСервера);
		ПараметрыПроверки.Вставить("Таймаут", ПараметрыВыполнения.Таймаут);	
		ПараметрыПроверки.Вставить("IDПроекта", Сведение.IDПроекта);
		ПараметрыПроверки.Вставить("ТокенАпи",  ПараметрыВыполнения.ТокенАпи);

		Проверка.ПроверитьНомерЗадачи(ПараметрыПроверки, СообщениеОбОшибке);
	КонецЕсли;
	//ПроверитьПараметрыЗапроса(ПараметрыЗапроса, СообщениеОбОшибке);

	Возврат СообщениеОбОшибке;

КонецФункции

Процедура УстановитьПараметрыВыполнения()
	
	Если ПараметрыВыполнения = Неопределено Тогда
		СценарийПараметрыВыполнения = ЗагрузитьСценарий(ОбъединитьПути(КаталогСценариев, "ПараметрыВыполнения.os"));
		ПараметрыВыполнения = СценарийПараметрыВыполнения.ПараметрыВыполнения();
	КонецЕсли;

КонецПроцедуры

КаталогСценариев = "E:\Buryakov\scripts\oscript\gitsync";

ПараметрыЗапроса = Новый Структура("ИмяСистемы", "test/ext_bit_da");
ПараметрыЗапроса.Вставить("Комментарий", "Тест хзадача #89");

ОбработкаПомещенияВХранилище(ПараметрыЗапроса);
ПостОбработкаПомещенияВХранилище(ПараметрыЗапроса);